dependencies/hisa/examples/shockTube/simulation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|                                                                             |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers {}

flowSolver
{
    solver            GMRES;
    GMRES
    {
        inviscidJacobian  LaxFriedrichs;
        preconditioner    LUSGS;
        maxIter           30;
        nKrylov           3;
        solverTolRel      1e-1 (1e-1 1e-1 1e-1) 1e-1;
    }
}

pseudoTime
{
    nPseudoCorr       20;
    pseudoTol         1e-4 (1e-4 1e-4 1e-4) 1e-4;
    pseudoCoNum       1;
    pseudoCoNumMax    100;
}

// ************************************************************************* //
